fireFoam-1.6-1.0/tutorials/hotPlateLaminar/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wallHot           
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    up         
    {
        type            inletOutlet;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);
    } 

    down          
    {
        type            pressureInletOutletVelocity;
	phi		phi;
	value		uniform	(0 0 0);		
    }

    cold          
    {
        type            pressureInletOutletVelocity;
	phi		phi;
	value		uniform (0 0 0);
    }

    sides1
    {
        type            cyclic;
	value		uniform (0 0 0);
    }

}


// ************************************************************************* //
