fireFoam-1.6-1.0/tutorials/hotPlateLaminar/0/alphaSgs
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          alphaSgs;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wallHot           
    {
        type            zeroGradient;
/*
        type            alphaSgsBuoyantWallFunction;
        beta            1.0/293.0;
        magG            9.80665;
        value           uniform 0.0;
*/
    }
    up      
    {
        type            zeroGradient;
    }
    down           
    {
        type            zeroGradient;
    }
    cold          
    {
        type            zeroGradient;
    }
    sides1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
